package utils

var certCourseMap = map[string][]string{
	"仿说训练营结课证书":         {"语言行为 | 仿说训练营"},
	"初级行为干预师":           {"孤独症康复专业进阶课（ABA初级）", "孤独症康复专业进阶课（ABA中级| 初+中）", "孤独症康复专业进阶课（ABA高级|初+中+高）", "A-PKU孤独症康复人才培养 | ABA高级课（升级版）"},
	"中级行为干预师":           {"孤独症康复专业进阶课（ABA中级| 初+中）", "A-PKU孤独症康复人才培养 | ABA高级课（升级版）", "孤独症康复专业进阶课（ABA高级|初+中+高）"},
	"高级行为干预师":           {"A-PKU孤独症康复人才培养 | ABA高级课（升级版）", "孤独症康复专业进阶课（ABA高级|初+中+高）"},
	"孤独症康复教育从业规范培训合格证书": {"2020年度全国孤独症康复教育从业规范（线上）培训班"},
	"ABA孤独症康复专业技能培训证书":  {"孤独症康复专业先修课"},
	"孤独症康复专业先修课":        {"孤独症康复专业先修课"},
	"孤独症筛查诊疗专家课结业证书":    {"孤独症筛查诊疗专家课"},
	"语言行为训练营（综合班）结课证书":  {"语言行为训练营（综合班）", "语言行为训练营（综合班）-升级版"},
	"VB-MAPP评估专业技能高级证书": {"A-PKU人才培养 | VB-MAPP评估专业技能高级培训"},
	"儿童言语语言治疗师高级专业技能证书": {"儿童言语语言治疗师专业技能培训"},
	"感觉统合治疗师高级专业技能证书":   {"A-PKU人才培养 | 儿童感觉统合治疗师专业技能培训（2020年首发版）"},
}

func CertNameToCourses(certName string) []string {
	return certCourseMap[certName]
}
